In [6]:
def fahr_to_kevin(temp):
    return ((temp-32)*(5/9))+273.15

In [7]:
fahr_to_kevin(32)

273.15

In [8]:
print('Freezing of boilingwater:',fahr_to_kevin(32))
print('Boiling water point:',fahr_to_kevin(212))

Freezing of boilingwater: 273.15
Boiling water point: 373.15

In [9]:
5/9

0.5555555555555556

In [10]:
def kevin_to_fahr(temp):
    return (temp-273)

In [11]:
print('Freezing point of water in fahr:',kevin_to_fahr(0))

Freezing point of water in fahr: -273

In [12]:
import numpy as np
import pandas as pd

#I am understaning how to load data

#Learning ipython

In [13]:
data=np.loadtxt(fname='C:\\Users\\Shan\\Desktop\\python-novice-inflammation\\data\\inflammation-01.csv',delimiter=',')

#This is for pandas

In [14]:
df1=pd.read_csv('C:\\Users\\Shan\\Desktop\\python-novice-inflammation\\data\\inflammation-01.csv',delimiter=',')

In [15]:
import pandas as pd
df1=pd.read_csv("http://pythonhow.com/wp-content/uploads/2016/01/Income_data.csv")

In [16]:
print(df1)

       GEOID       State   2005   2006   2007   2008   2009   2010   2011  \
0  04000US01     Alabama  37150  37952  42212  44476  39980  40933  42590
1  04000US02      Alaska  55891  56418  62993  63989  61604  57848  57431
2  04000US04     Arizona  45245  46657  47215  46914  45739  46896  48621
3  04000US05    Arkansas  36658  37057  40795  39586  36538  38587  41302
4  04000US06  California  51755  55319  55734  57014  56134  54283  53367

    2012   2013
0  43464  41381
1  63648  61137
2  47044  50602
3  39018  39919
4  57020  57528

In [17]:
df2=df1.set_index("State")

In [18]:
df2

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,47215,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [19]:
data=pd.Series([0.25,0.5,0.75,1.0])

In [22]:
ser=pd.Series([2,4,5])

In [23]:
ser

0    2
1    4
2    5
dtype: int64

In [25]:
area_dict={'California':423967,'Texas':343434,'india':344545}

In [28]:
area=pd.Series(area_dict)

In [33]:
area

California    423967
Texas         343434
india         344545
dtype: int64

In [34]:

import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [37]:
data['b']

0.5

In [38]:

area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [40]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [41]:
data.T

      California   Florida  Illinois  New York     Texas
area      423967    170312    149995    141297    695662
pop     38332521  19552860  12882135  19651127  26448193